grevaillot/svd_tools/headers/STM32F7x2/otg_fs_host.h
#pragma once 

/* --- OTG_FS_HOST: USB on the go full speed ------------------------ */

/** @defgroup otg_fs_host_registers USB on the go full speed Register
@{*/

/** OTG_FS_HOST_OTG_FS_HCFG OTG_FS host configuration register (OTG_FS_HCFG) **/
#define OTG_FS_HOST_OTG_FS_HCFG			MMIO32(OTG_FS_HOST_BASE + 0x00)
/** OTG_FS_HOST_OTG_FS_HFIR OTG_FS Host frame interval register **/
#define OTG_FS_HOST_OTG_FS_HFIR			MMIO32(OTG_FS_HOST_BASE + 0x04)
/** OTG_FS_HOST_OTG_FS_HFNUM OTG_FS host frame number/frame time remaining register (OTG_FS_HFNUM) **/
#define OTG_FS_HOST_OTG_FS_HFNUM			MMIO32(OTG_FS_HOST_BASE + 0x08)
/** OTG_FS_HOST_OTG_FS_HPTXSTS OTG_FS_Host periodic transmit FIFO/queue status register (OTG_FS_HPTXSTS) **/
#define OTG_FS_HOST_OTG_FS_HPTXSTS			MMIO32(OTG_FS_HOST_BASE + 0x10)
/** OTG_FS_HOST_OTG_FS_HAINT OTG_FS Host all channels interrupt register **/
#define OTG_FS_HOST_OTG_FS_HAINT			MMIO32(OTG_FS_HOST_BASE + 0x14)
/** OTG_FS_HOST_OTG_FS_HAINTMSK OTG_FS host all channels interrupt mask register **/
#define OTG_FS_HOST_OTG_FS_HAINTMSK			MMIO32(OTG_FS_HOST_BASE + 0x18)
/** OTG_FS_HOST_OTG_FS_HPRT OTG_FS host port control and status register (OTG_FS_HPRT) **/
#define OTG_FS_HOST_OTG_FS_HPRT			MMIO32(OTG_FS_HOST_BASE + 0x40)
/** OTG_FS_HOST_OTG_FS_HCCHAR0 OTG_FS host channel-0 characteristics register (OTG_FS_HCCHAR0) **/
#define OTG_FS_HOST_OTG_FS_HCCHAR0			MMIO32(OTG_FS_HOST_BASE + 0x100)
/** OTG_FS_HOST_OTG_FS_HCINT0 OTG_FS host channel-0 interrupt register (OTG_FS_HCINT0) **/
#define OTG_FS_HOST_OTG_FS_HCINT0			MMIO32(OTG_FS_HOST_BASE + 0x108)
/** OTG_FS_HOST_OTG_FS_HCINTMSK0 OTG_FS host channel-0 mask register (OTG_FS_HCINTMSK0) **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK0			MMIO32(OTG_FS_HOST_BASE + 0x10c)
/** OTG_FS_HOST_OTG_FS_HCTSIZ0 OTG_FS host channel-0 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ0			MMIO32(OTG_FS_HOST_BASE + 0x110)
/** OTG_FS_HOST_OTG_FS_HCCHAR1 OTG_FS host channel-1 characteristics register (OTG_FS_HCCHAR1) **/
#define OTG_FS_HOST_OTG_FS_HCCHAR1			MMIO32(OTG_FS_HOST_BASE + 0x120)
/** OTG_FS_HOST_OTG_FS_HCINT1 OTG_FS host channel-1 interrupt register (OTG_FS_HCINT1) **/
#define OTG_FS_HOST_OTG_FS_HCINT1			MMIO32(OTG_FS_HOST_BASE + 0x128)
/** OTG_FS_HOST_OTG_FS_HCINTMSK1 OTG_FS host channel-1 mask register (OTG_FS_HCINTMSK1) **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK1			MMIO32(OTG_FS_HOST_BASE + 0x12c)
/** OTG_FS_HOST_OTG_FS_HCTSIZ1 OTG_FS host channel-1 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ1			MMIO32(OTG_FS_HOST_BASE + 0x130)
/** OTG_FS_HOST_OTG_FS_HCCHAR2 OTG_FS host channel-2 characteristics register (OTG_FS_HCCHAR2) **/
#define OTG_FS_HOST_OTG_FS_HCCHAR2			MMIO32(OTG_FS_HOST_BASE + 0x140)
/** OTG_FS_HOST_OTG_FS_HCINT2 OTG_FS host channel-2 interrupt register (OTG_FS_HCINT2) **/
#define OTG_FS_HOST_OTG_FS_HCINT2			MMIO32(OTG_FS_HOST_BASE + 0x148)
/** OTG_FS_HOST_OTG_FS_HCINTMSK2 OTG_FS host channel-2 mask register (OTG_FS_HCINTMSK2) **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK2			MMIO32(OTG_FS_HOST_BASE + 0x14c)
/** OTG_FS_HOST_OTG_FS_HCTSIZ2 OTG_FS host channel-2 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ2			MMIO32(OTG_FS_HOST_BASE + 0x150)
/** OTG_FS_HOST_OTG_FS_HCCHAR3 OTG_FS host channel-3 characteristics register (OTG_FS_HCCHAR3) **/
#define OTG_FS_HOST_OTG_FS_HCCHAR3			MMIO32(OTG_FS_HOST_BASE + 0x160)
/** OTG_FS_HOST_OTG_FS_HCINT3 OTG_FS host channel-3 interrupt register (OTG_FS_HCINT3) **/
#define OTG_FS_HOST_OTG_FS_HCINT3			MMIO32(OTG_FS_HOST_BASE + 0x168)
/** OTG_FS_HOST_OTG_FS_HCINTMSK3 OTG_FS host channel-3 mask register (OTG_FS_HCINTMSK3) **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK3			MMIO32(OTG_FS_HOST_BASE + 0x16c)
/** OTG_FS_HOST_OTG_FS_HCTSIZ3 OTG_FS host channel-3 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ3			MMIO32(OTG_FS_HOST_BASE + 0x170)
/** OTG_FS_HOST_OTG_FS_HCCHAR4 OTG_FS host channel-4 characteristics register (OTG_FS_HCCHAR4) **/
#define OTG_FS_HOST_OTG_FS_HCCHAR4			MMIO32(OTG_FS_HOST_BASE + 0x180)
/** OTG_FS_HOST_OTG_FS_HCINT4 OTG_FS host channel-4 interrupt register (OTG_FS_HCINT4) **/
#define OTG_FS_HOST_OTG_FS_HCINT4			MMIO32(OTG_FS_HOST_BASE + 0x188)
/** OTG_FS_HOST_OTG_FS_HCINTMSK4 OTG_FS host channel-4 mask register (OTG_FS_HCINTMSK4) **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK4			MMIO32(OTG_FS_HOST_BASE + 0x18c)
/** OTG_FS_HOST_OTG_FS_HCTSIZ4 OTG_FS host channel-x transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ4			MMIO32(OTG_FS_HOST_BASE + 0x190)
/** OTG_FS_HOST_OTG_FS_HCCHAR5 OTG_FS host channel-5 characteristics register (OTG_FS_HCCHAR5) **/
#define OTG_FS_HOST_OTG_FS_HCCHAR5			MMIO32(OTG_FS_HOST_BASE + 0x1a0)
/** OTG_FS_HOST_OTG_FS_HCINT5 OTG_FS host channel-5 interrupt register (OTG_FS_HCINT5) **/
#define OTG_FS_HOST_OTG_FS_HCINT5			MMIO32(OTG_FS_HOST_BASE + 0x1a8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5 OTG_FS host channel-5 mask register (OTG_FS_HCINTMSK5) **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5			MMIO32(OTG_FS_HOST_BASE + 0x1ac)
/** OTG_FS_HOST_OTG_FS_HCTSIZ5 OTG_FS host channel-5 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ5			MMIO32(OTG_FS_HOST_BASE + 0x1b0)
/** OTG_FS_HOST_OTG_FS_HCCHAR6 OTG_FS host channel-6 characteristics register (OTG_FS_HCCHAR6) **/
#define OTG_FS_HOST_OTG_FS_HCCHAR6			MMIO32(OTG_FS_HOST_BASE + 0x1c0)
/** OTG_FS_HOST_OTG_FS_HCINT6 OTG_FS host channel-6 interrupt register (OTG_FS_HCINT6) **/
#define OTG_FS_HOST_OTG_FS_HCINT6			MMIO32(OTG_FS_HOST_BASE + 0x1c8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6 OTG_FS host channel-6 mask register (OTG_FS_HCINTMSK6) **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6			MMIO32(OTG_FS_HOST_BASE + 0x1cc)
/** OTG_FS_HOST_OTG_FS_HCTSIZ6 OTG_FS host channel-6 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ6			MMIO32(OTG_FS_HOST_BASE + 0x1d0)
/** OTG_FS_HOST_OTG_FS_HCCHAR7 OTG_FS host channel-7 characteristics register (OTG_FS_HCCHAR7) **/
#define OTG_FS_HOST_OTG_FS_HCCHAR7			MMIO32(OTG_FS_HOST_BASE + 0x1e0)
/** OTG_FS_HOST_OTG_FS_HCINT7 OTG_FS host channel-7 interrupt register (OTG_FS_HCINT7) **/
#define OTG_FS_HOST_OTG_FS_HCINT7			MMIO32(OTG_FS_HOST_BASE + 0x1e8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7 OTG_FS host channel-7 mask register (OTG_FS_HCINTMSK7) **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7			MMIO32(OTG_FS_HOST_BASE + 0x1ec)
/** OTG_FS_HOST_OTG_FS_HCTSIZ7 OTG_FS host channel-7 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ7			MMIO32(OTG_FS_HOST_BASE + 0x1f0)
/** OTG_FS_HOST_OTG_FS_HCCHAR8 OTG_FS host channel-8 characteristics register **/
#define OTG_FS_HOST_OTG_FS_HCCHAR8			MMIO32(OTG_FS_HOST_BASE + 0x200)
/** OTG_FS_HOST_OTG_FS_HCINT8 OTG_FS host channel-8 interrupt register **/
#define OTG_FS_HOST_OTG_FS_HCINT8			MMIO32(OTG_FS_HOST_BASE + 0x208)
/** OTG_FS_HOST_OTG_FS_HCINTMSK8 OTG_FS host channel-8 mask register **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK8			MMIO32(OTG_FS_HOST_BASE + 0x20c)
/** OTG_FS_HOST_OTG_FS_HCTSIZ8 OTG_FS host channel-8 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ8			MMIO32(OTG_FS_HOST_BASE + 0x210)
/** OTG_FS_HOST_OTG_FS_HCCHAR9 OTG_FS host channel-9 characteristics register **/
#define OTG_FS_HOST_OTG_FS_HCCHAR9			MMIO32(OTG_FS_HOST_BASE + 0x220)
/** OTG_FS_HOST_OTG_FS_HCINT9 OTG_FS host channel-9 interrupt register **/
#define OTG_FS_HOST_OTG_FS_HCINT9			MMIO32(OTG_FS_HOST_BASE + 0x228)
/** OTG_FS_HOST_OTG_FS_HCINTMSK9 OTG_FS host channel-9 mask register **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK9			MMIO32(OTG_FS_HOST_BASE + 0x22c)
/** OTG_FS_HOST_OTG_FS_HCTSIZ9 OTG_FS host channel-9 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ9			MMIO32(OTG_FS_HOST_BASE + 0x230)
/** OTG_FS_HOST_OTG_FS_HCCHAR10 OTG_FS host channel-10 characteristics register **/
#define OTG_FS_HOST_OTG_FS_HCCHAR10			MMIO32(OTG_FS_HOST_BASE + 0x240)
/** OTG_FS_HOST_OTG_FS_HCINT10 OTG_FS host channel-10 interrupt register **/
#define OTG_FS_HOST_OTG_FS_HCINT10			MMIO32(OTG_FS_HOST_BASE + 0x248)
/** OTG_FS_HOST_OTG_FS_HCINTMSK10 OTG_FS host channel-10 mask register **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK10			MMIO32(OTG_FS_HOST_BASE + 0x24c)
/** OTG_FS_HOST_OTG_FS_HCTSIZ10 OTG_FS host channel-10 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ10			MMIO32(OTG_FS_HOST_BASE + 0x250)
/** OTG_FS_HOST_OTG_FS_HCCHAR11 OTG_FS host channel-11 characteristics register **/
#define OTG_FS_HOST_OTG_FS_HCCHAR11			MMIO32(OTG_FS_HOST_BASE + 0x260)
/** OTG_FS_HOST_OTG_FS_HCINT11 OTG_FS host channel-11 interrupt register **/
#define OTG_FS_HOST_OTG_FS_HCINT11			MMIO32(OTG_FS_HOST_BASE + 0x268)
/** OTG_FS_HOST_OTG_FS_HCINTMSK11 OTG_FS host channel-11 mask register **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK11			MMIO32(OTG_FS_HOST_BASE + 0x26c)
/** OTG_FS_HOST_OTG_FS_HCTSIZ11 OTG_FS host channel-11 transfer size register **/
#define OTG_FS_HOST_OTG_FS_HCTSIZ11			MMIO32(OTG_FS_HOST_BASE + 0x270)

/**@}*/


/** @defgroup otg_fs_host_otg_fs_hcfg OTGFSHCFG OTG_FS host configuration register (OTG_FS_HCFG)
@{*/

/** OTG_FS_HOST_OTG_FS_HCFG_FSLSS FS- and LS-only support **/
#define OTG_FS_HOST_OTG_FS_HCFG_FSLSS		(1 << 2)

#define OTG_FS_HOST_OTG_FS_HCFG_FSLSPCS_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCFG_FSLSPCS_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcfg_fslspcs FSLSPCS FS/LS PHY clock select
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hfir OTGFSHFIR OTG_FS Host frame interval register
@{*/


#define OTG_FS_HOST_OTG_FS_HFIR_FRIVL_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HFIR_FRIVL_MASK		0xffff
/** @defgroup otg_fs_host_otg_fs_hfir_frivl FRIVL Frame interval
@{*/
/**@}*/


/**@}*/

