grevaillot/svd_tools/headers/STM32F7x2/otg_fs_host.h
#define OTG_FS_HOST_OTG_FS_HCTSIZ4_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ4_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcchar5 OTGFSHCCHAR5 OTG_FS host channel-5 characteristics register (OTG_FS_HCCHAR5)
@{*/

/** OTG_FS_HOST_OTG_FS_HCCHAR5_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR5_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_FS_HCCHAR5_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR5_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_FS_HCCHAR5_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_FS_HCCHAR5_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_FS_HCCHAR5_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_FS_HCCHAR5_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_fs_hcchar5_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR5_MCNT_SHIFT		20
#define OTG_FS_HOST_OTG_FS_HCCHAR5_MCNT_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar5_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR5_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_FS_HCCHAR5_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar5_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_FS_HCCHAR5_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_FS_HCCHAR5_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_FS_HCCHAR5_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_FS_HCCHAR5_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_FS_HCCHAR5_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_FS_HCCHAR5_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_fs_hcchar5_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR5_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCCHAR5_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_fs_hcchar5_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcint5 OTGFSHCINT5 OTG_FS host channel-5 interrupt register (OTG_FS_HCINT5)
@{*/

/** OTG_FS_HOST_OTG_FS_HCINT5_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_FS_HCINT5_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINT5_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_FS_HCINT5_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINT5_BBERR Babble error **/
#define OTG_FS_HOST_OTG_FS_HCINT5_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINT5_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_FS_HCINT5_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINT5_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT5_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINT5_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT5_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINT5_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT5_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINT5_CHH Channel halted **/
#define OTG_FS_HOST_OTG_FS_HCINT5_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINT5_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_FS_HCINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcintmsk5 OTGFSHCINTMSK5 OTG_FS host channel-5 mask register (OTG_FS_HCINTMSK5)
@{*/

/** OTG_FS_HOST_OTG_FS_HCINTMSK5_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINTMSK5_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK5_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hctsiz5 OTGFSHCTSIZ5 OTG_FS host channel-5 transfer size register
@{*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ5_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_FS_HCTSIZ5_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hctsiz5_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ5_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ5_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ5_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz5_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcchar6 OTGFSHCCHAR6 OTG_FS host channel-6 characteristics register (OTG_FS_HCCHAR6)
@{*/

/** OTG_FS_HOST_OTG_FS_HCCHAR6_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR6_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_FS_HCCHAR6_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR6_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_FS_HCCHAR6_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_FS_HCCHAR6_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_FS_HCCHAR6_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_FS_HCCHAR6_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_fs_hcchar6_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR6_MCNT_SHIFT		20
#define OTG_FS_HOST_OTG_FS_HCCHAR6_MCNT_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar6_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR6_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_FS_HCCHAR6_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar6_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_FS_HCCHAR6_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_FS_HCCHAR6_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_FS_HCCHAR6_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_FS_HCCHAR6_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_FS_HCCHAR6_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_FS_HCCHAR6_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_fs_hcchar6_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR6_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCCHAR6_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_fs_hcchar6_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcint6 OTGFSHCINT6 OTG_FS host channel-6 interrupt register (OTG_FS_HCINT6)
@{*/

