grevaillot/svd_tools/headers/STM32F7x2/otg_fs_host.h
/** OTG_FS_HOST_OTG_FS_HCINT6_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_FS_HCINT6_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINT6_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_FS_HCINT6_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINT6_BBERR Babble error **/
#define OTG_FS_HOST_OTG_FS_HCINT6_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINT6_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_FS_HCINT6_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINT6_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT6_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINT6_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT6_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINT6_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT6_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINT6_CHH Channel halted **/
#define OTG_FS_HOST_OTG_FS_HCINT6_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINT6_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_FS_HCINT6_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcintmsk6 OTGFSHCINTMSK6 OTG_FS host channel-6 mask register (OTG_FS_HCINTMSK6)
@{*/

/** OTG_FS_HOST_OTG_FS_HCINTMSK6_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINTMSK6_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK6_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hctsiz6 OTGFSHCTSIZ6 OTG_FS host channel-6 transfer size register
@{*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ6_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_FS_HCTSIZ6_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hctsiz6_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ6_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ6_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz6_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ6_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ6_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz6_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcchar7 OTGFSHCCHAR7 OTG_FS host channel-7 characteristics register (OTG_FS_HCCHAR7)
@{*/

/** OTG_FS_HOST_OTG_FS_HCCHAR7_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR7_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_FS_HCCHAR7_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR7_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_FS_HCCHAR7_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_FS_HCCHAR7_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_FS_HCCHAR7_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_FS_HCCHAR7_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_fs_hcchar7_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR7_MCNT_SHIFT		20
#define OTG_FS_HOST_OTG_FS_HCCHAR7_MCNT_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar7_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR7_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_FS_HCCHAR7_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar7_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_FS_HCCHAR7_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_FS_HCCHAR7_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_FS_HCCHAR7_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_FS_HCCHAR7_EPDIR		(1 << 15)

#define OTG_FS_HOST_OTG_FS_HCCHAR7_EPNUM_SHIFT		11
#define OTG_FS_HOST_OTG_FS_HCCHAR7_EPNUM_MASK		0x0f
/** @defgroup otg_fs_host_otg_fs_hcchar7_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR7_MPSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCCHAR7_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_host_otg_fs_hcchar7_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcint7 OTGFSHCINT7 OTG_FS host channel-7 interrupt register (OTG_FS_HCINT7)
@{*/

/** OTG_FS_HOST_OTG_FS_HCINT7_DTERR Data toggle error **/
#define OTG_FS_HOST_OTG_FS_HCINT7_DTERR		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINT7_FRMOR Frame overrun **/
#define OTG_FS_HOST_OTG_FS_HCINT7_FRMOR		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINT7_BBERR Babble error **/
#define OTG_FS_HOST_OTG_FS_HCINT7_BBERR		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINT7_TXERR Transaction error **/
#define OTG_FS_HOST_OTG_FS_HCINT7_TXERR		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINT7_ACK ACK response received/transmitted interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT7_ACK		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINT7_NAK NAK response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT7_NAK		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINT7_STALL STALL response received interrupt **/
#define OTG_FS_HOST_OTG_FS_HCINT7_STALL		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINT7_CHH Channel halted **/
#define OTG_FS_HOST_OTG_FS_HCINT7_CHH		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINT7_XFRC Transfer completed **/
#define OTG_FS_HOST_OTG_FS_HCINT7_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcintmsk7 OTGFSHCINTMSK7 OTG_FS host channel-7 mask register (OTG_FS_HCINTMSK7)
@{*/

/** OTG_FS_HOST_OTG_FS_HCINTMSK7_DTERRM Data toggle error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_DTERRM		(1 << 10)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7_FRMORM Frame overrun mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_FRMORM		(1 << 9)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7_BBERRM Babble error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_BBERRM		(1 << 8)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7_TXERRM Transaction error mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_TXERRM		(1 << 7)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7_NYET response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_NYET		(1 << 6)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_ACKM		(1 << 5)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7_NAKM NAK response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_NAKM		(1 << 4)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7_STALLM STALL response received interrupt mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_STALLM		(1 << 3)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7_CHHM Channel halted mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_CHHM		(1 << 1)
/** OTG_FS_HOST_OTG_FS_HCINTMSK7_XFRCM Transfer completed mask **/
#define OTG_FS_HOST_OTG_FS_HCINTMSK7_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_host_otg_fs_hctsiz7 OTGFSHCTSIZ7 OTG_FS host channel-7 transfer size register
@{*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ7_DPID_SHIFT		29
#define OTG_FS_HOST_OTG_FS_HCTSIZ7_DPID_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hctsiz7_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ7_PKTCNT_SHIFT		19
#define OTG_FS_HOST_OTG_FS_HCTSIZ7_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_host_otg_fs_hctsiz7_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCTSIZ7_XFRSIZ_SHIFT		0
#define OTG_FS_HOST_OTG_FS_HCTSIZ7_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_host_otg_fs_hctsiz7_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_host_otg_fs_hcchar8 OTGFSHCCHAR8 OTG_FS host channel-8 characteristics register
@{*/

/** OTG_FS_HOST_OTG_FS_HCCHAR8_CHENA Channel enable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR8_CHENA		(1 << 31)
/** OTG_FS_HOST_OTG_FS_HCCHAR8_CHDIS Channel disable **/
#define OTG_FS_HOST_OTG_FS_HCCHAR8_CHDIS		(1 << 30)
/** OTG_FS_HOST_OTG_FS_HCCHAR8_ODDFRM Odd frame **/
#define OTG_FS_HOST_OTG_FS_HCCHAR8_ODDFRM		(1 << 29)

#define OTG_FS_HOST_OTG_FS_HCCHAR8_DAD_SHIFT		22
#define OTG_FS_HOST_OTG_FS_HCCHAR8_DAD_MASK		0x7f
/** @defgroup otg_fs_host_otg_fs_hcchar8_dad DAD Device address
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR8_MCNT_SHIFT		20
#define OTG_FS_HOST_OTG_FS_HCCHAR8_MCNT_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar8_mcnt MCNT Multicount
@{*/
/**@}*/


#define OTG_FS_HOST_OTG_FS_HCCHAR8_EPTYP_SHIFT		18
#define OTG_FS_HOST_OTG_FS_HCCHAR8_EPTYP_MASK		0x03
/** @defgroup otg_fs_host_otg_fs_hcchar8_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_HOST_OTG_FS_HCCHAR8_LSDEV Low-speed device **/
#define OTG_FS_HOST_OTG_FS_HCCHAR8_LSDEV		(1 << 17)
/** OTG_FS_HOST_OTG_FS_HCCHAR8_EPDIR Endpoint direction **/
#define OTG_FS_HOST_OTG_FS_HCCHAR8_EPDIR		(1 << 15)

